УНФ_ТЕСТ/src/InformationRegisters/КП_СвязиОбъектов_Удалить/КП_СвязиОбъектов_Удалить.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_СвязиОбъектов_Удалить</name>
  <resources>
    <name>Объект2ВышеОбъекта1</name>
    <comment>Объект 2 вышестоящий, иначе Объект 1 вышестоящий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект1</name>
    <type>
      <types>TaskRef.КП_Задача</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект2</name>
    <type>
      <types>TaskRef.КП_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/КП_СвязиОбъектов_Удалить/Forms/ФормаЗаписи/Module.bsl
Процедура УстановитьКартинку()
	Если Запись.Объект2ВышеОбъекта1 Тогда
		Элементы.КартинкаСвязи.Картинка=БиблиотекаКартинок.ПереместитьВверх;
	Иначе
		Элементы.КартинкаСвязи.Картинка=БиблиотекаКартинок.ПереместитьВниз;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВышестоящийОбъект=Неопределено;
	Если ЭтаФорма.Параметры.Свойство("ВышестоящийДокумент", ВышестоящийОбъект) Тогда
		Запись.Объект1=ВышестоящийОбъект;
	КонецЕсли;
	
	НижестоящийОбъект=Неопределено;
	Если ЭтаФорма.Параметры.Свойство("НижестоящийДокумент", НижестоящийОбъект) Тогда
		Запись.Объект2=НижестоящийОбъект;
		//Запись.Объект2ВышеОбъекта1=Истина;
	КонецЕсли;
	
	УстановитьКартинку();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИзменитьТипСвязиНажатие(Элемент)
	Запись.Объект2ВышеОбъекта1=НЕ Запись.Объект2ВышеОбъекта1;
	УстановитьКартинку();
КонецПроцедуры
